#include <iostream>
#include <bitset>

extern "C" unsigned char asm_func();

int main() {
	unsigned char x = asm_func();
	std::cout << std::bitset<8 * sizeof(x)>(x);

	return 0;
}

//ƒопустим, у нас есть число 11001101b.
//
//ѕерва€ итераци€ :
//rcr al, 1 : AL становитс€ 01100110b, CF = 1 (младший бит 1).
//rcl bl, 1 : BL становитс€ 00000001b(в CF был 1, он переместилс€ в младший бит BL).
// 
//¬тора€ итераци€ :
//rcr al, 1 : AL становитс€ 00110011b, CF = 0.
//rcl bl, 1 : BL становитс€ 00000010b(в CF был 0, он переместилс€ в младший бит BL, а существующий бит сдвинулс€ влево).
// 
//“реть€ итераци€ :
//rcr al, 1 : AL становитс€ 00011001b, CF = 1.
//rcl bl, 1 : BL становитс€ 00000101b(в CF был 1, добавлен к регистру BL).